Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.ОстаткиТоваров.Записывать = Истина;
	
	Для Каждого Строка Из Товары Цикл
		Движение = Движения.ОстаткиТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Товар = Строка.Товар;
		// склад один на весь документ, он в шапке, поэтому без «Строка.»
		
		Движение.Склад = СкладПолучатель;
		Движение.Количество = Строка.Количество; 
		Движение = Движения.ОстаткиТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;   
		Движение.Период = Дата;
		Движение.Товар = Строка.Товар;
		// склад один на весь документ, он в шапке, поэтому без «Строка.»
		Движение.Склад = СкладОтправитель;
		Движение.Количество = Строка.Количество;
	КонецЦикла;
	
КонецПроцедуры