
&НаСервере
Процедура ВыполнитьНаСервере()
	
	// Задание 36. По кнопке «Выполнить» выведи наименования всех товаров из справочника «Товары». 1/20
	ЗапросВыводВсехТоваровСправочника = Новый Запрос;
	ЗапросВыводВсехТоваровСправочника.Текст = "ВЫБРАТЬ
	|  Товары.Наименование КАК Наименование
	|ИЗ
	|  Справочник.Товары КАК Товары" ;										  
	ВыборкаВыводВсехТоваровСправочника = ЗапросВыводВсехТоваровСправочника.Выполнить().Выбрать(); 
	Пока ВыборкаВыводВсехТоваровСправочника.Следующий() Цикл
		Сообщить("Товар из справочника: " + ВыборкаВыводВсехТоваровСправочника.Наименование);
	КонецЦикла;
	
	// Задание 37. Выведи наименование и артикул только весовых товаров. 2/20
	
	ЗапросНаименованиеАртикулГдеВес = Новый Запрос; 
	ЗапросНаименованиеАртикулГдеВес.УстановитьПараметр("Весовой",Истина);	
	ЗапросНаименованиеАртикулГдеВес.Текст = "ВЫБРАТЬ 	
	|  Товары.Наименование КАК Наименование,
	|  Товары.Артикул Как Артикул,
	|  Товары.Весовой Как Весовой
	|ИЗ
	|  Справочник.Товары КАК Товары
	|ГДЕ
	|  Товары.Весовой = &Весовой" ;
	ВыборкаЗапросНаименованиеАртикулГдеВес = ЗапросНаименованиеАртикулГдеВес.Выполнить().Выбрать();
	Пока ВыборкаЗапросНаименованиеАртикулГдеВес.Следующий() Цикл	
		Сообщить("Товар: " + ВыборкаЗапросНаименованиеАртикулГдеВес.Наименование + ". Артикул: " + ВыборкаЗапросНаименованиеАртикулГдеВес.Артикул + ". Весовой товар");
	КонецЦикла;
	
	
	// Задание 39. Выведи номер и дату всех документов «Приход товара», самые новые сверху. 3/20
	ЗапросВсеПриходыТоваров = Новый Запрос; 
	ЗапросВсеПриходыТоваров.Текст = "ВЫБРАТЬ
	|  Приход.Номер КАК Номер,
	|  Приход.Дата КАК Дата
	|ИЗ
	|  Документ.ПриходТовара КАК Приход
	|УПОРЯДОЧИТЬ ПО
	|  Дата УБЫВ
	|";
	ВыборкаЗапросВсеПриходыТоваров = ЗапросВсеПриходыТоваров.Выполнить().Выбрать();
	Пока ВыборкаЗапросВсеПриходыТоваров.Следующий() Цикл
		Сообщить(ВыборкаЗапросВсеПриходыТоваров.Номер + " от " + ВыборкаЗапросВсеПриходыТоваров.Дата);
	КонецЦикла;
	
	
	// Задание 40. Выведи все строки товаров из всех документов «Приход товара»: номер документа, товар и количество.
	ЗапросНомерДокТоварКоличество = Новый Запрос;
	ЗапросНомерДокТоварКоличество.Текст = "ВЫБРАТЬ
	|  Приход.Ссылка.Номер КАК Номер,
	|  Приход.Товар КАК Товар,
	|  Приход.Количество КАК Количество
	|
	|ИЗ
	|  Документ.ПриходТовара.Товары КАК Приход
	|"; 
	ВыборкаЗапросНомерДокТоварКоличество = ЗапросНомерДокТоварКоличество.Выполнить().Выбрать();
	Пока ВыборкаЗапросНомерДокТоварКоличество.Следующий() Цикл
		Сообщить("Номер документа: " + ВыборкаЗапросНомерДокТоварКоличество.Номер + " " + ВыборкаЗапросНомерДокТоварКоличество.Товар + " " + ВыборкаЗапросНомерДокТоварКоличество.Количество);
	КонецЦикла;
	
	
	// Задание 41-42. Выведи, сколько всего пришло каждого товара по всем документам «Приход товара» за всё время.
	ЗапросВсеТоварыВсеВремя = Новый Запрос;
	ЗапросВсеТоварыВсеВремя.УстановитьПараметр("Проведен", Истина);
	ЗапросВсеТоварыВсеВремя.Текст = "ВЫБРАТЬ
	|  Приход.Товар КАК Товар,
	|  СУММА(Приход.Количество) КАК Количество
	|ИЗ
	|  Документ.ПриходТовара.Товары КАК Приход 
	|ГДЕ
	|  Приход.Ссылка.Проведен = &Проведен
	|СГРУППИРОВАТЬ ПО
	|  Приход.Товар
	|  
	|
	|" ;
	ВыборкаЗапросВсеТоварыВсеВремя = ЗапросВсеТоварыВсеВремя.Выполнить().Выбрать();
	Пока ВыборкаЗапросВсеТоварыВсеВремя.Следующий() Цикл
		Сообщить("Товара: " + ВыборкаЗапросВсеТоварыВсеВремя.Товар + ". Пришло за всё время: " + ВыборкаЗапросВсеТоварыВсеВремя.Количество);
	КонецЦикла; 
	
	
	// Задание 43. Выведи текущие остатки всех товаров по всем складам: склад, товар, остаток.
	
	ЗапросСкладТоварОстаток = Новый Запрос;
	ЗапросСкладТоварОстаток.Текст = "ВЫБРАТЬ
	|   Остатки.Товар КАК Товар,
	|   Остатки.Склад КАК Склад,
	|   СУММА(Остатки.КоличествоОстаток) КАК КоличествоОстаток
	|ИЗ
	|  РегистрНакопления.ОстаткиТоваров.Остатки КАК Остатки
	|СГРУППИРОВАТЬ ПО
	|  Остатки.Товар,
	|  Остатки.Склад
	|" ;
	ВыборкаЗапросСкладТоварОстаток = ЗапросСкладТоварОстаток.Выполнить().Выбрать();
	Пока ВыборкаЗапросСкладТоварОстаток.Следующий() Цикл
		Сообщить("Склад: " + ВыборкаЗапросСкладТоварОстаток.Склад + ". Товар: " + ВыборкаЗапросСкладТоварОстаток.Товар + ". Остаток: " + ВыборкаЗапросСкладТоварОстаток.КоличествоОстаток);
	КонецЦикла;      
	
	
	// Задание 44. Выведи остатки всех товаров только на складе «Магазин». 
	// Склад отбери в параметрах виртуальной таблицы, как в контроле остатков. 
	
	ЗапросВсеТоварыМагазин = Новый Запрос;
	СкладМагазин = Справочники.Склады.НайтиПоНаименованию("Магазин"); 
	ЗапросВсеТоварыМагазин.УстановитьПараметр("Склад", СкладМагазин);
	ЗапросВсеТоварыМагазин.Текст = "ВЫБРАТЬ
	|  Остатки.Товар КАК Товар,
	|  Остатки.КоличествоОстаток КАК Остаток
	|ИЗ
	|  РегистрНакопления.ОстаткиТоваров.Остатки(, Склад = &Склад) КАК Остатки
	|
	|";
	ВыборкаЗапросВсеТоварыМагазин = ЗапросВсеТоварыМагазин.Выполнить().Выбрать();
	Пока ВыборкаЗапросВсеТоварыМагазин.Следующий() Цикл
		Сообщить("Товар со склада Магазин: " + ВыборкаЗапросВсеТоварыМагазин.Товар + ". Остаток: " + ВыборкаЗапросВсеТоварыМагазин.Остаток);
	КонецЦикла;
	
	
	// Задание 45. Выведи все товары из справочника «Товары» и текущую цену каждого. 
	// Если цены у товара нет, выведи 0.
	
	
	ЗапросВсеТоварыИТекЦена = Новый Запрос;
	ЗапросВсеТоварыИТекЦена.Текст = "ВЫБРАТЬ
	|  Товары.Наименование КАК Наименование,
	|  ЕСТЬNULL(ЦеныТоваровСрезПоследних.Цена, 0) КАК ПоследняяЦена
	|
	|ИЗ
	|  Справочник.Товары КАК Товары
	|        ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныТоваров.СрезПоследних КАК ЦеныТоваровСрезПоследних
	|        ПО ЦеныТоваровСрезПоследних.Товар = Товары.Ссылка
	|
	|";
	ВыборкаЗапросВсеТоварыИТекЦена = ЗапросВсеТоварыИТекЦена.Выполнить().Выбрать();
	Пока ВыборкаЗапросВсеТоварыИТекЦена.Следующий() Цикл
		Сообщить("Товар: " + ВыборкаЗапросВсеТоварыИТекЦена.Наименование + ". Текущая цена: " + ВыборкаЗапросВсеТоварыИТекЦена.ПоследняяЦена);
	КонецЦикла;
	
	
	// Задание 46. Выведи, сколько каждого товара ушло со склада «Магазин» за всё время.
	
	ЗапросУходТовараСМагазин = Новый Запрос;
	СкладМагазин = Справочники.Склады.НайтиПоНаименованию("Магазин");
	ЗапросУходТовараСМагазин.УстановитьПараметр("Склад", СкладМагазин); 
	ЗапросУходТовараСМагазин.Текст = "Выбрать
	|   СУММА(ОстаткиТоваровРасход.КоличествоРасход) КАК Количество,
	|   ОстаткиТоваровРасход.Товар КАК Товар
	|
	|ИЗ
	|  РегистрНакопления.ОстаткиТоваров.Обороты(, , , Склад = &Склад) КАК ОстаткиТоваровРасход
	|СГРУППИРОВАТЬ ПО
	|  ОстаткиТоваровРасход.Товар
	|";
	ВыборкаЗапросУходТовараСМагазин = ЗапросУходТовараСМагазин.Выполнить().Выбрать();
	Пока ВыборкаЗапросУходТовараСМагазин.Следующий() Цикл
		Сообщить("Товара: " + ВыборкаЗапросУходТовараСМагазин.Товар + ". Ушло со склада за всё время: " + ВыборкаЗапросУходТовараСМагазин.Количество);
	КонецЦикла;
	
	
	// Задание 47. Выведи номер, дату и клиента всех проведённых документов «Возврат от покупателя».
	
	ЗапросНомерДатаКлиентыПроведен = Новый Запрос;
	ЗапросНомерДатаКлиентыПроведен.УстановитьПараметр("Проведен", Истина);
	ЗапросНомерДатаКлиентыПроведен.Текст = "Выбрать
	|  Возврат.Дата КАК Дата,
	|  Возврат.Клиент КАК Клиент,
	|  Возврат.Номер КАК Номер
	|ИЗ
	|  Документ.ВозвратОтПокупателя КАК Возврат
	|ГДЕ
	|   Возврат.Проведен = &Проведен" ; 	
	ВыборкаЗапросНомерДатаКлиентыПроведен = ЗапросНомерДатаКлиентыПроведен.Выполнить().Выбрать();
	Пока ВыборкаЗапросНомерДатаКлиентыПроведен.Следующий() Цикл
		Сообщить("Номер документа: " + ВыборкаЗапросНомерДатаКлиентыПроведен.Номер + " от: " + ВыборкаЗапросНомерДатаКлиентыПроведен.Дата + " Клиент: " + ВыборкаЗапросНомерДатаКлиентыПроведен.Клиент);
	КонецЦикла; 
	
	
	// Задание 48. Выведи клиентов, у которых нет ни одного возврата.
	
	ЗапросКлиентыБезВозвратов = Новый Запрос;
	ЗапросКлиентыБезВозвратов.Текст = "ВЫБРАТЬ
	|		Клиенты.Наименование КАК Клиент
	|ИЗ
	|	Справочник.Клиенты КАК Клиенты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВозвратОтПокупателя КАК Возврат
	|		ПО Клиенты.Ссылка = Возврат.Клиент.Ссылка
	|ГДЕ
	|		Возврат.Клиент ЕСТЬ NULL      
	|" ;
	ВыборкаЗапросКлиентыБезВозвратов = ЗапросКлиентыБезВозвратов.Выполнить().Выбрать();
	Пока ВыборкаЗапросКлиентыБезВозвратов.Следующий() Цикл
		Сообщить("Клиент: " + ВыборкаЗапросКлиентыБезВозвратов.Клиент + " 0 возвратов");
	КонецЦикла;
	
	
	// Задание 49. Выведи только те товары, у которых есть цена, вместе с ценой. 
	// Используй не ЛЕВОЕ, а ВНУТРЕННЕЕ соединение.
	ЗапросВсеТоварыИТекЦена = Новый Запрос;
	ЗапросВсеТоварыИТекЦена.Текст = "ВЫБРАТЬ
	|	Товары.Наименование КАК Наименование,
	|	ЦеныТоваровСрезПоследних.Цена КАК ПоследняяЦена
	|ИЗ
	|	Справочник.Товары КАК Товары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныТоваров.СрезПоследних КАК ЦеныТоваровСрезПоследних
	|		ПО (ЦеныТоваровСрезПоследних.Товар = Товары.Ссылка)";
	ВыборкаЗапросВсеТоварыИТекЦена = ЗапросВсеТоварыИТекЦена.Выполнить().Выбрать();
	Пока ВыборкаЗапросВсеТоварыИТекЦена.Следующий() Цикл
		Сообщить("Товар: " + ВыборкаЗапросВсеТоварыИТекЦена.Наименование + ". Текущая цена: " + ВыборкаЗапросВсеТоварыИТекЦена.ПоследняяЦена);
	КонецЦикла;
	
	// Задание 50. Покажи, сколько каждого товара ушло со склада «Магазин» с 1 по 20 октября.
	
	
	ЗапросТоварУшелМагазин = Новый Запрос;
	ЗапросТоварУшелМагазин.УстановитьПараметр("НачалоПериода",НачалоДня(Дата(2026, 10, 1)));
	ЗапросТоварУшелМагазин.УстановитьПараметр("КонецПериода",КонецДня(Дата(2026, 10, 20)));	
	СкладМагазин = Справочники.Склады.НайтиПоНаименованию("Магазин");
	ЗапросТоварУшелМагазин.УстановитьПараметр("Склад",СкладМагазин);
	ЗапросТоварУшелМагазин.Текст = "ВЫБРАТЬ
	|  КоличествоРас.КоличествоРасход КАК КоличествоУшедшее, 
	|  КоличествоРас.Товар.Наименование КАК Товар
	|ИЗ
	|  РегистрНакопления.ОстаткиТоваров.Обороты(&НачалоПериода,&КонецПериода, ,Склад = &Склад) КАК КоличествоРас
	|";
	ВыборкаЗапросТоварУшелМагазин = ЗапросТоварУшелМагазин.Выполнить().Выбрать(); 
	Пока ВыборкаЗапросТоварУшелМагазин.Следующий() Цикл
		Сообщить("Товара: " + ВыборкаЗапросТоварУшелМагазин.Товар + " Ушло со склада Магазин: " + ВыборкаЗапросТоварУшелМагазин.КоличествоУшедшее);
	КонецЦикла;
	
	
	// Задание 51. Покажи все документы «Расход товара» с 1 по 20 октября: номер и дату.
	
	
	ЗапросВсеРасходыТоваровДата = Новый Запрос;
	ЗапросВсеРасходыТоваровДата.УстановитьПараметр("НачалоПериода",НачалоДня(Дата(2026,10,1)));
	ЗапросВсеРасходыТоваровДата.УстановитьПараметр("КонецПериода",КонецДня(Дата(2026,10,20)));
	ЗапросВсеРасходыТоваровДата.Текст = "ВЫБРАТЬ
	|  Расход.Номер,
	|  Расход.Дата
	|ИЗ
	|  Документ.РасходТовара КАК Расход
	|ГДЕ
	|  Расход.Дата >= &НачалоПериода
	|  И Расход.Дата <= &КонецПериода
	|";
	ВыборкаЗапросВсеРасходыТоваровДата = ЗапросВсеРасходыТоваровДата.Выполнить().Выбрать();
	Пока ВыборкаЗапросВсеРасходыТоваровДата.Следующий() Цикл
		Сообщить("Документ №: " + ВыборкаЗапросВсеРасходыТоваровДата.Номер + ". От: " + ВыборкаЗапросВсеРасходыТоваровДата.Дата);
	КонецЦикла;
	
	
	// Задание 52. Выведи, на какую сумму продан каждый товар 
	// по документам «Расход товара» с 1 по 20 октября.  
	
	
	ЗапросСуммаТоваровРасходДата = Новый Запрос;
	ЗапросСуммаТоваровРасходДата.УстановитьПараметр("НачалоПериода",НачалоДня(Дата(2026,10,1)));
	ЗапросСуммаТоваровРасходДата.УстановитьПараметр("КонецПериода",КонецДня(Дата(2026,10,20)));
	ЗапросСуммаТоваровРасходДата.УстановитьПараметр("Проведен", Истина);
	ЗапросСуммаТоваровРасходДата.Текст = "ВЫБРАТЬ
	|  Расход.Товар КАК Товар,
	|  СУММА(Расход.Сумма) КАК Сумма
	|
	|ИЗ
	|  Документ.РасходТовара.Товары КАК Расход
	| 
	|ГДЕ
	|  Расход.Ссылка.Дата >= &НачалоПериода
	|  И Расход.Ссылка.Дата <= &КонецПериода
	|  И Расход.Ссылка.Проведен = &Проведен
	|СГРУППИРОВАТЬ ПО
	|  Расход.Товар
	|" ;
	ВыборкаЗапросСуммаТоваровРасходДата = ЗапросСуммаТоваровРасходДата.Выполнить().Выбрать();
	Пока ВыборкаЗапросСуммаТоваровРасходДата.Следующий() Цикл
		Сообщить("По Документу - Расход Товара - Товар: " + ВыборкаЗапросСуммаТоваровРасходДата.Товар +
		". Продан на Сумму: " + ВыборкаЗапросСуммаТоваровРасходДата.Сумма );
	КонецЦикла;  
	
	
	// Задание 53. Выведи остатки всех товаров на складе «Магазин» на конец дня 13 октября.
	
	
	ЗапросОстаткиМагазинКонецДня = Новый Запрос;
	СкладМагазин = Справочники.Склады.НайтиПоНаименованию("Магазин");
	ЗапросОстаткиМагазинКонецДня.УстановитьПараметр("Склад", СкладМагазин);
	ЗапросОстаткиМагазинКонецДня.УстановитьПараметр("Дата", КонецДня(Дата(2026,10,13)));
	ЗапросОстаткиМагазинКонецДня.Текст = "ВЫБРАТЬ
	|  Остатки.КоличествоОстаток КАК Количество,
	|  Остатки.Товар КАК Товар
	|ИЗ
	|  РегистрНакопления.ОстаткиТоваров.Остатки(&Дата, Склад = &Склад) КАК Остатки
	|";
	ВыборкаОстаткиМагазинКонецДня = ЗапросОстаткиМагазинКонецДня.Выполнить().Выбрать();
	Пока ВыборкаОстаткиМагазинКонецДня.Следующий() Цикл
		Сообщить("Остаток на складе Магазин товара: " + ВыборкаОстаткиМагазинКонецДня.Товар +
		". Количество: " + ВыборкаОстаткиМагазинКонецДня.Количество);
	КонецЦикла;
	
	
	// Задание 54. Выведи каждого клиента и общую сумму его возвратов
	// по проведённым документам «Возврат от покупателя»
	// за всё время, сверху тот, кто вернул больше всех.    
	
	
	ЗапросКлиентыСуммаВозвратовДата = Новый Запрос;
	ЗапросКлиентыСуммаВозвратовДата.УстановитьПараметр("Проведен", Истина);
	ЗапросКлиентыСуммаВозвратовДата.Текст = "ВЫБРАТЬ
	|  Возврат.Ссылка.Клиент КАК Клиент,
	|  СУММА(Возврат.Сумма) КАК Сумма
	|ИЗ
	|  Документ.ВозвратОтПокупателя.Товары КАК Возврат
	|ГДЕ
	|  Возврат.Ссылка.Проведен = &Проведен  
	|СГРУППИРОВАТЬ ПО
	|  Возврат.Ссылка.Клиент
	| 
	|УПОРЯДОЧИТЬ ПО
	|  Сумма УБЫВ
	|";
	ВыборкаЗапросКлиентыСуммаВозвратовДата = ЗапросКлиентыСуммаВозвратовДата.Выполнить().Выбрать();
	Пока ВыборкаЗапросКлиентыСуммаВозвратовДата.Следующий() Цикл
		Сообщить("Клиент: " + ВыборкаЗапросКлиентыСуммаВозвратовДата.Клиент +
		". Вернул на Сумму: " + ВыборкаЗапросКлиентыСуммаВозвратовДата.Сумма);
	КонецЦикла; 
	
	
	// Задание 55. Выведи товары, которые сейчас есть на складе «Магазин»:
	// товар, остаток и текущая цена.  
	
	
	ЗапросТоварОстатокТекЦенаСклад = Новый Запрос;
	СкладМагазин = Справочники.Склады.НайтиПоНаименованию("Магазин");
	ЗапросТоварОстатокТекЦенаСклад.УстановитьПараметр("Склад", СкладМагазин);
	ЗапросТоварОстатокТекЦенаСклад.Текст = "ВЫБРАТЬ
	|  Остатки.Товар Как Товар,
	|  Остатки.КоличествоОстаток Как Остаток,
	|  ЕСТЬNULL(Регистр.Цена,0) Как Цена
	|
	|ИЗ
	|  РегистрНакопления.ОстаткиТоваров.Остатки(,Склад = &Склад) Как Остатки
	|  ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныТоваров.СрезПоследних Как Регистр
	|  ПО Остатки.Товар = Регистр.Товар
	|
	|";
	ВыборкаЗапросТоварОстатокТекЦенаСклад = ЗапросТоварОстатокТекЦенаСклад.Выполнить().Выбрать();
	Пока ВыборкаЗапросТоварОстатокТекЦенаСклад.Следующий() Цикл
		Сообщить("На складе Магазин есть: " + ВыборкаЗапросТоварОстатокТекЦенаСклад.Товар +
		". Количество: " + ВыборкаЗапросТоварОстатокТекЦенаСклад.Остаток + 
		". Текущая цена: " + ВыборкаЗапросТоварОстатокТекЦенаСклад.Цена);
	КонецЦикла;
	
	
	// Задание 56. Выведи остатки товаров по каждому складу
	// и под каждым складом его общий остаток. 
	
	
	ЗапросОстатокТоваровОбщСумма = Новый Запрос;
	ЗапросОстатокТоваровОбщСумма.Текст = "ВЫБРАТЬ
	|  Остатки.Склад Как Склад,
	|  Остатки.Товар Как Товар,
	|  Остатки.КоличествоОстаток КАК Остаток
	|ИЗ
	|  РегистрНакопления.ОстаткиТоваров.Остатки КАК Остатки
	|ИТОГИ
	|  СУММА(Остаток)
	|ПО
	|  Склад
	|
	|";
	ВыборкаЗапросОстатокТоваровОбщСумма = ЗапросОстатокТоваровОбщСумма.Выполнить().Выбрать();
	Пока ВыборкаЗапросОстатокТоваровОбщСумма.Следующий() Цикл
		Если ВыборкаЗапросОстатокТоваровОбщСумма.Товар = NULL Тогда
			Сообщить("Итого на складе " + ВыборкаЗапросОстатокТоваровОбщСумма.Склад +
			": " + ВыборкаЗапросОстатокТоваровОбщСумма.Остаток);
		Иначе
			Сообщить("По складу: " + ВыборкаЗапросОстатокТоваровОбщСумма.Склад +
			". Товар: " + ВыборкаЗапросОстатокТоваровОбщСумма.Товар +
			". Остаток: " + ВыборкаЗапросОстатокТоваровОбщСумма.Остаток);
		КонецЕсли;
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗапрос(Команда)
	ВыполнитьНаСервере();
КонецПроцедуры
