	Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)   
		
	
	
   

     //Задание 13. В документе «Списание товара» при записи выведи по каждому товару(Все существующие товары у которых были движения)
	 // , сколько его ушло со склада документа(По любой причине) за месяц документа.  
	 // Хлеб ушло за месяц: 35
	 // Молоко ушло за месяц: 1   
	 
	 
      ЗапросТоварЗаМесяц = Новый Запрос;
	  ЗапросТоварЗаМесяц.УстановитьПараметр("НачалоМесяца",НачалоМесяца(Дата));
	  ЗапросТоварЗаМесяц.УстановитьПараметр("КонецМесяца",КонецМесяца(Дата));
	  ЗапросТоварЗаМесяц.УстановитьПараметр("Склад", Склад);

	  
	  ЗапросТоварЗаМесяц.Текст = "ВЫБРАТЬ
	                             |	ОстаткиТоваровОбороты.Товар КАК Товар,
	                             |	СУММА(ОстаткиТоваровОбороты.КоличествоРасход) КАК КоличествоРасход
	                             |ИЗ
	                             |	РегистрНакопления.ОстаткиТоваров.Обороты(&НачалоМесяца, &КонецМесяца, , ) КАК ОстаткиТоваровОбороты
	                             |ГДЕ
	                             |	ОстаткиТоваровОбороты.Склад = &Склад
	                             |
	                             |СГРУППИРОВАТЬ ПО
	                             |	ОстаткиТоваровОбороты.Товар" ;
	  ВыборкаЗапросТоварЗаМесяц = ЗапросТоварЗаМесяц.Выполнить().Выбрать();
	  Пока ВыборкаЗапросТоварЗаМесяц.Следующий() Цикл
		  Сообщить("" + ВыборкаЗапросТоварЗаМесяц.Товар + " Ушло за месяц: " + ВыборкаЗапросТоварЗаМесяц.КоличествоРасход);
		  КонецЦикла;
		  
		  
    // Задание 14. В документе СписаниеТовара при записи выведи номер и дату каждого расхода, 
	// сделанного со склада списания за тот месяц, в котором проведено списание. 
	// Расход 000000001 от 12.10.2026 19:45:00
    // Расход 000000002 от 13.10.2026 1:33:00    
	
	ЗапросНомерДатаВсехРасходов = Новый Запрос; 
	ЗапросНомерДатаВсехРасходов.УстановитьПараметр("НачалоМесяца",НачалоМесяца(Дата));
	ЗапросНомерДатаВсехРасходов.УстановитьПараметр("КонецМесяца",КонецМесяца(Дата));
	ЗапросНомерДатаВсехРасходов.УстановитьПараметр("Склад",Склад);
	ЗапросНомерДатаВсехРасходов.Текст = "ВЫБРАТЬ
	                                    |	РасходТовара.Номер КАК Номер,
	                                    |	РасходТовара.Дата КАК Дата
	                                    |ИЗ
	                                    |	Документ.РасходТовара КАК РасходТовара
	                                    |ГДЕ
	                                    |	РасходТовара.Склад = &Склад
	                                    |	И РасходТовара.Дата >= &НачалоМесяца
	                                    |	И РасходТовара.Дата <= &КонецМесяца" ;
	ВыборкаНомерДатаВсехРасходов = ЗапросНомерДатаВсехРасходов.Выполнить().Выбрать();
	Пока ВыборкаНомерДатаВсехРасходов.Следующий() Цикл
		Сообщить("Расход " + ВыборкаНомерДатаВсехРасходов.Номер + " от " + ВыборкаНомерДатаВсехРасходов.Дата );
		КонецЦикла;

	

	
	
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.ОстаткиТоваров.Записывать = Истина;
	// Движения - Слово 1С, ОстаткиТоваров-Мы создали, мы как бы говорим, запиши 
	
	Для Каждого Строка Из Товары Цикл
		Движение = Движения.ОстаткиТоваров.Добавить();
		//  Движение = Движение.ОстаткиТоваров.Добавить(); - Этим мы создаем движение
		// и все следующие Движение. Передадутся в остаткитоваров как расход или приход т.е Мы добавляем 
		// значения в то что далее указываем
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата; // т.к это не строка, а шапка, тут не указываем Строка
		Движение.Склад = Склад; 
		Движение.Товар = Строка.Товар;   // т.к это страка, а не шапка, тут указываем СТрока
		Движение.Количество = Строка.Количество;
	КонецЦикла; 
	
	
	Движения.ОстаткиТоваров.Записать();
	
	// Шаг 1 из 4. В ОбработкаПроведения, в самом начале, 
	// выведи сообщением каждый товар документа
	// с общим количеством по всем его строкам. Это как Задание 31.
	
	ЗапросТоварКоличествоВсе = Новый Запрос;                                                                                                                      	
	ЗапросТоварКоличествоВсе.УстановитьПараметр("Ссылка", Ссылка);
	ЗапросТоварКоличествоВсе.УстановитьПараметр("Склад", Склад);

	ЗапросТоварКоличествоВсе.Текст = "ВЫБРАТЬ
	                                 |	СписаниеТовараТовары.Товар КАК Товар,
	                                 |	СУММА(СписаниеТовараТовары.Количество) КАК Количество
	                                 |ПОМЕСТИТЬ НехваткаКолВоИТекСклад
	                                 |ИЗ
	                                 |	Документ.СписаниеТовара.Товары КАК СписаниеТовараТовары
	                                 |ГДЕ
	                                 |	СписаниеТовараТовары.Ссылка = &Ссылка
	                                 |
	                                 |СГРУППИРОВАТЬ ПО
	                                 |	СписаниеТовараТовары.Товар
	                                 |;
	                                 |
	                                 |////////////////////////////////////////////////////////////////////////////////
	                                 |ВЫБРАТЬ
	                                 |	НехваткаКолВоИТекСклад.Товар КАК Товар,
	                                 |	НехваткаКолВоИТекСклад.Количество КАК Количество,
	                                 |	ЕСТЬNULL(ОстаткиТоваровОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток
	                                 |ИЗ
	                                 |	НехваткаКолВоИТекСклад КАК НехваткаКолВоИТекСклад
	                                 |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиТоваров.Остатки(, Склад = &Склад) КАК ОстаткиТоваровОстатки
	                                 |		ПО (ОстаткиТоваровОстатки.Товар = НехваткаКолВоИТекСклад.Товар)" ;
	ВыборкаТоварКоличествоВсе = ЗапросТоварКоличествоВсе.Выполнить().Выбрать();
	Пока ВыборкаТоварКоличествоВсе.Следующий() Цикл 
		// «сколько нужно» и «сколько есть на складе из шапки».
		Если ВыборкаТоварКоличествоВсе.КоличествоОстаток < 0 Тогда 
			РазницаНехватки = -ВыборкаТоварКоличествоВсе.КоличествоОстаток; 
			Сообщить("На остатках недостаточно товара! " + ВыборкаТоварКоличествоВсе.Товар + ", не хватает: " + РазницаНехватки);
			Отказ = Истина;
			КонецЕсли;
		КонецЦикла;

	
	
КонецПроцедуры