 Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения) 
	 // Задание 17. В документе ВозвратОтПокупателя при записи выведи номер, дату и сумму 
	 // каждого возврата от клиента этого документа за месяц документа.

     //Возврат 000000001 от 17.10.2026 20:08:20 на сумму 0  
	 
	 ЗапросВыводНомераДатыСуммы = Новый Запрос;
	 ЗапросВыводНомераДатыСуммы.УстановитьПараметр("Клиент", Клиент);
     ЗапросВыводНомераДатыСуммы.УстановитьПараметр("НачалоМесяца",НачалоМесяца(Дата));
	 ЗапросВыводНомераДатыСуммы.УстановитьПараметр("КонецМесяца",КонецМесяца(Дата));
	 ЗапросВыводНомераДатыСуммы.Текст = "ВЫБРАТЬ
	                                    |	ВозвратОтПокупателя.Номер КАК Номер,
	                                    |	ВозвратОтПокупателя.Дата КАК Дата,
	                                    |	ВозвратОтПокупателя.СуммаВозврата КАК СуммаВозврата
	                                    |ИЗ
	                                    |	Документ.ВозвратОтПокупателя КАК ВозвратОтПокупателя
	                                    |ГДЕ
	                                    |	ВозвратОтПокупателя.Клиент = &Клиент
	                                    |	И ВозвратОтПокупателя.Дата >= &НачалоМесяца
	                                    |	И ВозвратОтПокупателя.Дата <= &КонецМесяца" ;
	 
	 ВыборкаЗапросВыводНомераДатыСуммы = ЗапросВыводНомераДатыСуммы.Выполнить().Выбрать();
	 
	 Пока ВыборкаЗапросВыводНомераДатыСуммы.Следующий() Цикл
		 Сообщить("Возврат " + ВыборкаЗапросВыводНомераДатыСуммы.Номер + " От " + ВыборкаЗапросВыводНомераДатыСуммы.Дата + " на сумму " + ВыборкаЗапросВыводНомераДатыСуммы.СуммаВозврата );
	 КонецЦикла;  
	 
	 
	 
	// Задание 18. В документе ВозвратОтПокупателя при записи выведи,
	// сколько каждого товара вернули за месяц документа,
	// по всем клиентам. 
	// Хлеб вернули: 3
	
	ЗапросТоварВернулиЗаМесяц = Новый Запрос;
	ЗапросТоварВернулиЗаМесяц.УстановитьПараметр("НачалоМесяца", НачалоМесяца(Дата));
		ЗапросТоварВернулиЗаМесяц.УстановитьПараметр("КонецМесяца", КонецМесяца(Дата));

	ЗапросТоварВернулиЗаМесяц.Текст = "ВЫБРАТЬ
	                                  |	ВозвратОтПокупателяТовары.Товар КАК Товар,
	                                  |	СУММА(ВозвратОтПокупателяТовары.Количество) КАК Количество
	                                  |ИЗ
	                                  |	Документ.ВозвратОтПокупателя.Товары КАК ВозвратОтПокупателяТовары
	                                  |ГДЕ
	                                  |	ВозвратОтПокупателяТовары.Ссылка.Дата >= &НачалоМесяца
	                                  |	И ВозвратОтПокупателяТовары.Ссылка.Дата <= &КонецМесяца
	                                  |
	                                  |СГРУППИРОВАТЬ ПО
	                                  |	ВозвратОтПокупателяТовары.Товар" ;
	
	ВыборкаЗапросТоварВернулиЗаМесяц = ЗапросТоварВернулиЗаМесяц.Выполнить().Выбрать();
	Пока ВыборкаЗапросТоварВернулиЗаМесяц.Следующий() Цикл
		Сообщить("" + ВыборкаЗапросТоварВернулиЗаМесяц.Товар + " вернули: " + ВыборкаЗапросТоварВернулиЗаМесяц.Количество); 
		КонецЦикла;
	 

	 
 
 КонецПроцедуры
 
 
 Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	 
	 Движения.ОстаткиТоваров.Записывать = Истина;
	 
	 Для Каждого Строка Из Товары Цикл
		 Движение = Движения.ОстаткиТоваров.Добавить(); 
		 
		 Движение.ВидДвижения = ВидДвиженияНакопления.Приход; 
		 Движение.Склад = Склад;
		 
		 Движение.Период = Дата; 
		 
		 Движение.Товар = Строка.Товар;
		 Движение.Количество = Строка.Количество;
		 
		 
	 КонецЦикла;
 КонецПроцедуры