 Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения) 
	 // Задание 17. В документе ВозвратОтПокупателя при записи выведи номер, дату и сумму 
	 // каждого возврата от клиента этого документа за месяц документа.

     //Возврат 000000001 от 17.10.2026 20:08:20 на сумму 0  
	 
	 ЗапросВыводНомераДатыСуммы = Новый Запрос;
	 ЗапросВыводНомераДатыСуммы.УстановитьПараметр("Клиент", Клиент);
     ЗапросВыводНомераДатыСуммы.УстановитьПараметр("НачалоМесяца",НачалоМесяца(Дата));
	 ЗапросВыводНомераДатыСуммы.УстановитьПараметр("КонецМесяца",КонецМесяца(Дата));
	 ЗапросВыводНомераДатыСуммы.Текст = "ВЫБРАТЬ
	                                    |	ВозвратОтПокупателя.Номер КАК Номер,
	                                    |	ВозвратОтПокупателя.Дата КАК Дата,
	                                    |	ВозвратОтПокупателя.СуммаВозврата КАК СуммаВозврата
	                                    |ИЗ
	                                    |	Документ.ВозвратОтПокупателя КАК ВозвратОтПокупателя
	                                    |ГДЕ
	                                    |	ВозвратОтПокупателя.Клиент = &Клиент
	                                    |	И ВозвратОтПокупателя.Дата >= &НачалоМесяца
	                                    |	И ВозвратОтПокупателя.Дата <= &КонецМесяца" ;
	 
	 ВыборкаЗапросВыводНомераДатыСуммы = ЗапросВыводНомераДатыСуммы.Выполнить().Выбрать();
	 
	 Пока ВыборкаЗапросВыводНомераДатыСуммы.Следующий() Цикл
		 Сообщить("Возврат " + ВыборкаЗапросВыводНомераДатыСуммы.Номер + " От " + ВыборкаЗапросВыводНомераДатыСуммы.Дата + " на сумму " + ВыборкаЗапросВыводНомераДатыСуммы.СуммаВозврата );
	 КонецЦикла;  
	 
	 
	 
	// Задание 18. В документе ВозвратОтПокупателя при записи выведи,
	// сколько каждого товара вернули за месяц документа,
	// по всем клиентам. 
	// Хлеб вернули: 3
	
	ЗапросТоварВернулиЗаМесяц = Новый Запрос;
	ЗапросТоварВернулиЗаМесяц.УстановитьПараметр("НачалоМесяца", НачалоМесяца(Дата));
		ЗапросТоварВернулиЗаМесяц.УстановитьПараметр("КонецМесяца", КонецМесяца(Дата));

	ЗапросТоварВернулиЗаМесяц.Текст = "ВЫБРАТЬ
	                                  |	ВозвратОтПокупателяТовары.Товар КАК Товар,
	                                  |	СУММА(ВозвратОтПокупателяТовары.Количество) КАК Количество
	                                  |ИЗ
	                                  |	Документ.ВозвратОтПокупателя.Товары КАК ВозвратОтПокупателяТовары
	                                  |ГДЕ
	                                  |	ВозвратОтПокупателяТовары.Ссылка.Дата >= &НачалоМесяца
	                                  |	И ВозвратОтПокупателяТовары.Ссылка.Дата <= &КонецМесяца
	                                  |
	                                  |СГРУППИРОВАТЬ ПО
	                                  |	ВозвратОтПокупателяТовары.Товар" ;
	
	ВыборкаЗапросТоварВернулиЗаМесяц = ЗапросТоварВернулиЗаМесяц.Выполнить().Выбрать();
	Пока ВыборкаЗапросТоварВернулиЗаМесяц.Следующий() Цикл
		Сообщить("" + ВыборкаЗапросТоварВернулиЗаМесяц.Товар + " вернули: " + ВыборкаЗапросТоварВернулиЗаМесяц.Количество); 
		КонецЦикла;
		
		
		
		// Задание 20. В документе ВозвратОтПокупателя при записи выведи,
		//на какую сумму за месяц возврата вернул товар каждый клиент. 
		// Сумму бери из строк товаров.   
		
		// Возврат на сумму 000, от клиента Вася
		
		ЗапросВозвратКлиентСумма = Новый Запрос; 
		ЗапросВозвратКлиентСумма.УстановитьПараметр("НачалоМесяца", НачалоМесяца(Дата));
		ЗапросВозвратКлиентСумма.УстановитьПараметр("КонецМесяца", КонецМесяца(Дата));
		ЗапросВозвратКлиентСумма.Текст = "ВЫБРАТЬ
		                                 |	ВозвратОтПокупателяТовары.Ссылка.Клиент КАК Клиент,
		                                 |	СУММА(ВозвратОтПокупателяТовары.Сумма) КАК Сумма
		                                 |ИЗ
		                                 |	Документ.ВозвратОтПокупателя.Товары КАК ВозвратОтПокупателяТовары
		                                 |ГДЕ
		                                 |	ВозвратОтПокупателяТовары.Ссылка.Дата >= &НачалоМесяца
		                                 |	И ВозвратОтПокупателяТовары.Ссылка.Дата <= &КонецМесяца
		                                 |
		                                 |СГРУППИРОВАТЬ ПО
		                                 |	ВозвратОтПокупателяТовары.Ссылка.Клиент" ;
		ВыборкаВозвратКлиентСумма = ЗапросВозвратКлиентСумма.Выполнить().Выбрать();
		Пока ВыборкаВозвратКлиентСумма.Следующий() Цикл 
			Сообщить("Возврат на сумму: " + ВыборкаВозвратКлиентСумма.Сумма + ", от клиента: " + ВыборкаВозвратКлиентСумма.Клиент);
			КонецЦикла;
			
			ЗапросПоискПустыхКлиентов = Новый Запрос;
			ЗапросПоискПустыхКлиентов.Текст = "ВЫБРАТЬ
			                                  |	ВозвратОтПокупателя.Номер КАК Номер,
			                                  |	ВозвратОтПокупателя.Дата КАК Дата
			                                  |ИЗ
			                                  |	Документ.ВозвратОтПокупателя КАК ВозвратОтПокупателя
			                                  |ГДЕ
			                                  |	ВозвратОтПокупателя.Клиент = ЗНАЧЕНИЕ(Справочник.Клиенты.ПустаяСсылка)" ; 
			ВыборкаПоискПустыхКлиентов = ЗапросПоискПустыхКлиентов.Выполнить().Выбрать();
			Пока ВыборкаПоискПустыхКлиентов.Следующий() Цикл
				Сообщить("Возврат с незаполненым клиентом: " + ВыборкаПоискПустыхКлиентов.Номер + " от " + ВыборкаПоискПустыхКлиентов.Дата);
				КонецЦикла;
 
 КонецПроцедуры
 
 
 Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	 
	 Движения.ОстаткиТоваров.Записывать = Истина;
	 
	 Для Каждого Строка Из Товары Цикл
		 Движение = Движения.ОстаткиТоваров.Добавить(); 
		 
		 Движение.ВидДвижения = ВидДвиженияНакопления.Приход; 
		 Движение.Склад = Склад;
		 
		 Движение.Период = Дата; 
		 
		 Движение.Товар = Строка.Товар;
		 Движение.Количество = Строка.Количество;
		 
		 
	 КонецЦикла;
 КонецПроцедуры


 Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	 //{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	 // Данный фрагмент построен конструктором.
	 // При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	 Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РасходТовара") Тогда
		 // Заполнение шапки
		 Склад = ДанныеЗаполнения.Склад;
		 Для Каждого ТекСтрокаТовары Из ДанныеЗаполнения.Товары Цикл
			 НоваяСтрока = Товары.Добавить();
			 НоваяСтрока.Количество = ТекСтрокаТовары.Количество;
			 НоваяСтрока.Сумма = ТекСтрокаТовары.Сумма;
			 НоваяСтрока.Товар = ТекСтрокаТовары.Товар;
		 КонецЦикла;
	 КонецЕсли;
	 //}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ 
	 
	 СуммаВозврата = 0;
	 
	 
	 Для Каждого Строка Из Товары Цикл
			 СуммаВозврата = СуммаВозврата + Строка.Сумма;
		 КонецЦикла;
		 
 КонецПроцедуры    
 
 Функция ПосчитатьСумму(Кол,Цена)
	 Возврат Кол * Цена;
	 КонецФункции;
 

