Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если Товары.Количество() = 0 Тогда
		Сообщить("Добавьте хотя бы один товар!");
		Отказ = Истина;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Поставщик) Тогда
		Сообщить("Укажите поставщика!");
		Отказ = Истина;
	КонецЕсли;
	
	СуммаДокумента = 0;
	
	Для Каждого Строка Из Товары Цикл
		
		Если НЕ ЗначениеЗаполнено(Строка.Количество) Тогда
			Сообщить("В строке " + Строка.НомерСтроки + " не указано количество!");
			Отказ = Истина;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Строка.Цена) Тогда
			Сообщить("В строке " + Строка.НомерСтроки + " не указана цена!");
			Отказ = Истина;
		КонецЕсли;
		
		Строка.Сумма = ПосчитатьСумму(Строка.Количество, строка.Цена);
		СуммаДокумента = СуммаДокумента + Строка.Сумма;
		
	КонецЦикла;
	
	ПоказатьИтоги(СуммаДокумента);	
	
	Для Сч = 1 По 10 Цикл
		Сообщить("3 x " + Сч + " = " + 3 * Сч);
	КонецЦикла;
	
КонецПроцедуры

Процедура ПоказатьИтоги(Сумма)
	Сообщить("Итого: " + Сумма);
КонецПроцедуры

Функция ПосчитатьСумму(Кол, Цена)
	Возврат кол * цена;	   
КонецФункции

