Процедура ПередЗаписью(Отказ)
	
	// убираем пробелы по краям названия
	Наименование = СокрЛП(Наименование);
	
	// длину названия кладём в свою переменную, само название не трогаем
	ДлинаНазвания = СтрДлина(СокрЛП(Наименование));
	
	Если ДлинаНазвания = 0 Тогда
		Сообщить("Наименование не может быть пустым!");
		Отказ = Истина;
	ИначеЕсли ДлинаНазвания < 3 Тогда
		Сообщить("Наименование не может быть меньше 3 символов!");
		Отказ = Истина;
	КонецЕсли;  
	
    // Задание 24. В справочнике Товары при записи любого товара вывести все товары справочника,
	// у которых нет ни одной цены в регистре цен.	 
	
	// Задание 25. С изм. на временную таблицу
	ЗапросТоварыБезЦен = Новый Запрос;
	ЗапросТоварыБезЦен.Текст = "ВЫБРАТЬ
	                           |	Товары.Наименование КАК Наименование
	                           |ПОМЕСТИТЬ ВТТоварыБезЦен
	                           |ИЗ
	                           |	Справочник.Товары КАК Товары
	                           |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныТоваров КАК ЦеныТоваров
	                           |		ПО (ЦеныТоваров.Товар = Товары.Ссылка)
	                           |ГДЕ
	                           |	ЦеныТоваров.Цена ЕСТЬ NULL
	                           |;
	                           |
	                           |////////////////////////////////////////////////////////////////////////////////
	                           |ВЫБРАТЬ
	                           |	ВТТоварыБезЦен.Наименование КАК Наименование
	                           |ИЗ
	                           |	ВТТоварыБезЦен КАК ВТТоварыБезЦен" ;
	ВыборкаТоварыБезЦен = ЗапросТоварыБезЦен.Выполнить().Выбрать();
	Пока ВыборкаТоварыБезЦен.Следующий() Цикл
		Сообщить("Товар без цены: " + ВыборкаТоварыБезЦен.Наименование);
	КонецЦикла;      
	
	
	// Задания 25: при записи любого товара вывести все товары справочника и их текущую цену.
	
	ЗапросВсеТоварыТекЦены = Новый Запрос;
	ЗапросВсеТоварыТекЦены.Текст = "ВЫБРАТЬ
	                               |	Товары.Ссылка КАК Ссылка,
	                               |	ЕСТЬNULL(ЦеныТоваровСрезПоследних.Цена, 0) КАК Цена
	                               |ИЗ
	                               |	Справочник.Товары КАК Товары
	                               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныТоваров.СрезПоследних КАК ЦеныТоваровСрезПоследних
	                               |		ПО (ЦеныТоваровСрезПоследних.Товар = Товары.Ссылка)" ;
	ВыборкаВсеТоварыТекЦены = ЗапросВсеТоварыТекЦены.Выполнить().Выбрать();
	Пока ВыборкаВсеТоварыТекЦены.Следующий() Цикл
		Сообщить("Товар: " + ВыборкаВсеТоварыТекЦены.Ссылка + " его текущая цена: " + ВыборкаВсеТоварыТекЦены.Цена );
		КонецЦикла;
	
	
	
	    КонецПроцедуры
